/***********************************
 * Create Date:  14/11/12 11:47:37
 * Author     ： Aaron Yuan
 * Description: 每一项值都是2的n次幂才可以
 * ********************************/

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Payment.Fuiou.Fuyou
{
    
    /// <summary>
    /// 代码描述
    /// </summary>
    public class ErroCode
    {
        public static Dictionary<string, string> dic = new Dictionary<string, string>();

        //select 'dic.Add("'+code+ '", "'+des+'*'+des2+'");' from s1
        static ErroCode()
        {
            dic.Add("0000", "交易成功*交易成功");
            dic.Add("1000", "取系统跟踪号失败*系统异常");
            dic.Add("1001", "无此用户*无此用户");
            dic.Add("1002", "用户未激活*用户未激活");
            dic.Add("1003", "用户已锁定*用户已锁定");
            dic.Add("1004", "用户已关闭*用户状态异常");
            dic.Add("1005", "用户已禁用*用户状态异常");
            dic.Add("1006", "未知的用户类型*用户状态异常");
            dic.Add("1007", "用户未指定*未知用户");
            dic.Add("1008", "实名信息不合法*实名信息不正确");
            dic.Add("1009", "取授权号失败*系统异常");
            dic.Add("1014", "无效卡号(无此卡号)*无效卡号(无此卡号)");
            dic.Add("1042", "无此账户*无此账户");
            dic.Add("1051", "资金不足*资金不足");
            dic.Add("1101", "无此商户*无此商户");
            dic.Add("1102", "商户（或机构）已关闭*商户已关闭");
            dic.Add("1103", "商户已锁定*商户已锁定");
            dic.Add("2000", "账户状态正常*正常账户");
            dic.Add("2001", "无此账户*无此账户");
            dic.Add("2002", "账户未激活*账户未激活");
            dic.Add("2003", "账户已锁定*账户已锁定");
            dic.Add("2004", "账户已冻结*账户已冻结");
            dic.Add("2005", "账户已销户*账户状态异常");
            dic.Add("2006", "账户已过期*账户状态异常");
            dic.Add("2007", "账户已挂失*账户状态异常");
            dic.Add("2008", "账户状态不正常*账户状态异常");
            dic.Add("2010", "分户状态正常*账户状态异常");
            dic.Add("2011", "找不到分户*账户状态异常");
            dic.Add("2012", "分户未激活*账户状态异常");
            dic.Add("2013", "分户已锁定*账户状态异常");
            dic.Add("2014", "分户已冻结*账户状态异常");
            dic.Add("2015", "分户已销户*账户状态异常");
            dic.Add("2016", "分户已过期*账户状态异常");
            dic.Add("2017", "分户已挂失*账户状态异常");
            dic.Add("2018", "分户状态不正常*账户状态异常");
            dic.Add("2019", "账户币种与交易币种不符*交易币种不符");
            dic.Add("2020", "未指定分户*暂不支持");
            dic.Add("2030", "贷记账户状态正常*贷记账户状态正常");
            dic.Add("2031", "无此贷记账户*无此贷记账户");
            dic.Add("2032", "贷记账户未激活*贷记账户未激活");
            dic.Add("2033", "贷记账户已锁定*贷记账户已锁定");
            dic.Add("2034", "贷记账户已冻结*贷记账户已冻结");
            dic.Add("2035", "贷记账户已销户*贷记账户已销户");
            dic.Add("2036", "贷记账户已过期*贷记账户已过期");
            dic.Add("2037", "贷记账户已挂失*贷记账户已挂失");
            dic.Add("2038", "贷记账户状态不正常*贷记账户状态不正常");
            dic.Add("2039", "借贷记账记不属于同一个机构*借贷记账记不属于同一个机构");
            dic.Add("2040", "借记账户不属于发起交易的机构*怀疑作弊");
            dic.Add("2041", "贷记账户不属于发起交易的机构*怀疑作弊");
            dic.Add("2101", "账号长度非法*怀疑作弊");
            dic.Add("2102", "账号检验失败*怀疑作弊");
            dic.Add("2103", "账户查询密码未设置*安全验证错误");
            dic.Add("2104", "账户支付密码未设置*安全验证错误");
            dic.Add("2105", "查询密码错误*查询密码错误");
            dic.Add("2106", "支付密码错误*支付密码错误");
            dic.Add("2107", "查询密码错误次数超限*查询密码错误次数超限");
            dic.Add("2108", "支付密码错误次数超限*支付密码错误次数超限");
            dic.Add("2109", "未知的密码类型*格式错");
            dic.Add("3001", "功能暂不支持*功能暂不支持");
            dic.Add("3002", "未知的交易代码*功能暂不支持");
            dic.Add("3003", "验证MAC失败*安全验证错误");
            dic.Add("3004", "不支持的交易*功能暂不支持");
            dic.Add("3005", "禁止账户使用的交易*功能暂不支持");
            dic.Add("3006", "禁止连接机构进行的交易*功能暂不支持");
            dic.Add("3007", "无法确定交易账户的分户*功能暂不支持");
            dic.Add("3011", "网关类交易金额超过上限*交易金额太大");
            dic.Add("3012", "金额无效*金额无效");
            dic.Add("3013", "账户未转结余额小于0*余额不足");
            dic.Add("3014", "未转结余额不足（小于交易金额）*余额不足");
            dic.Add("3015", "账户冻结余额小于0*余额不足");
            dic.Add("3016", "已冻结余额不足（小于交易金额）*余额不足");
            dic.Add("3017", "可用余额小于0*余额不足");
            dic.Add("3018", "可用余额不足*余额不足");
            dic.Add("3019", "交易金额小于下限*交易金额太小");
            dic.Add("3020", "账户总余额不为0*余额不足");
            dic.Add("3021", "账户总余额不足*余额不足");
            dic.Add("3022", "交易金额不足以支付手续费*交易金额太小");
            dic.Add("3023", "账户可用余额小于「交易金额+手续费」*余额不足");
            dic.Add("3024", "作业类交易金额超过上限*金额太大");
            dic.Add("3101", "找不到原交易(或原交易不成功)*找不到原交易");
            dic.Add("3102", "原交易不成功*原交易不成功");
            dic.Add("3103", "原交易已冲正*原交易已冲正");
            dic.Add("3104", "原交易已撤消*原交易已撤消");
            dic.Add("3105", "原交易已完成*原交易已完成");
            dic.Add("3106", "原交易已冻结*原交易已冻结");
            dic.Add("3107", "原交易已解冻*原交易已解冻");
            dic.Add("3108", "原交易金额不符*原交易金额不符");
            dic.Add("3109", "原交易账号不符*原交易账号不符");
            dic.Add("3110", "找不到原始授权交易*找不到原始授权交易");
            dic.Add("3111", "原交易清算日期非法*原交易状态异常");
            dic.Add("3112", "原交易不是清算交易*原交易状态异常");
            dic.Add("3120", "不需要记授权历史记录（参数错误）*系统异常");
            dic.Add("3121", "与原授权交易商户不匹配*商户不匹配");
            dic.Add("3122", "原授权交易已全部完成*交易已完成");
            dic.Add("3123", "交易卡号不匹配*卡号不匹配");
            dic.Add("3124", "交易金额超过可完成（解冻/撤消）的金额*金额超限");
            dic.Add("3125", "交易金额与原授权金额不一致*金额不一致");
            dic.Add("3126", "终端号不一致*终端号不一致");
            dic.Add("3127", "不在同一清算日内*隔日交易，无法完成");
            dic.Add("3201", "清分记账失败*记账失败");
            dic.Add("3251", "提现账户未指定*提现账户未指定");
            dic.Add("3252", "找商户附加信息错*商户信息不完整");
            dic.Add("3253", "提现账户用法错误(24域)*格式错");
            dic.Add("3271", "清分超时*交易超时");
            dic.Add("3272", "记账超时*交易超时");
            dic.Add("4001", "找不到指定的账户产品*不允许开此账户");
            dic.Add("4002", "不允许开户机构使用的账户产品*不允许开此账户");
            dic.Add("4003", "找不到指定账户产品的BIN号*系统异常");
            dic.Add("4004", "找不到指定科目的BIN号（或该科目不允许开分户）*不允许开此账户");
            dic.Add("4005", "某一BIN号的账户号资源已用完*不允许开此账户");
            dic.Add("4006", "记客户账号表出错*系统异常");
            dic.Add("4007", "记客户内部账号表出错*系统异常");
            dic.Add("4008", "记基本账户表出错*系统异常");
            dic.Add("4009", "账户产品已过期，不能使用*不支持的开户方式");
            dic.Add("4010", "企业用户不能开对私账户*不支持的开户方式");
            dic.Add("4011", "个人用户不能开对公账户*不支持的开户方式");
            dic.Add("4012", "记客户账户密码失败*系统异常");
            dic.Add("4013", "个人客户账户已存在*不可重复开户");
            dic.Add("5001", "session超时*session超时");
            dic.Add("5002", "验签失败*验签失败");
            dic.Add("5110", "用户名或密码错误*用户名或密码错误");
            dic.Add("5017", "修改用户信息时未做任何修改*未做任何修改");
            dic.Add("5018", "根据地区代码和行别找不到对应支行*根据地区代码和行别找不到对应支行");
            dic.Add("5019", "数据校验失败*数据校验失败");
            dic.Add("5029", "调用交易查询接口过于频繁*调用交易查询接口过于频繁");
            dic.Add("5137", "账户信息不能修改*账户信息不能修改");
            dic.Add("5138", "系统异常*系统异常");
            dic.Add("5239", "商户不存在*商户不存在");
            dic.Add("5343", "用户已开户*用户已开户");
            dic.Add("5344", "账务系统开户失败*账务系统开户失败");
            dic.Add("5345", "商户流水号重复*商户流水号重复");
            dic.Add("5346", "商户流水号不存在*商户流水号不存在");
            dic.Add("5347", "与商户系统日期不一致*与商户系统日期不一致");
            dic.Add("5348", "交易用户不存在*交易用户不存在");
            dic.Add("5349", "找不到原交易*找不到原交易");
            dic.Add("5350", "指令提交模式只支持富友余额支付*指令提交模式只支持富友余额支付");
            dic.Add("5351", "商户提现流水号重复*商户提现流水号重复");
            dic.Add("5352", "未找到该商户交易记录*未找到该商户交易记录");
            dic.Add("5353", "接收FAS报文出现异常*接收FAS报文出现异常");
            dic.Add("5354", "FAS报文验签失败*FAS报文验签失败");
            dic.Add("5355", "发送FAS通讯出现异常*发送FAS通讯出现异常");
            dic.Add("5356", "该卡号已认证*该卡号已认证");
            dic.Add("5357", "该卡号已经受理且认证通过*该卡号已经受理且认证通过");
            dic.Add("5358", "该卡号已经受理,但尚未认证通过*该卡号已经受理,但尚未认证通过");
            dic.Add("5359", "该卡号尚未签约*该卡号尚未签约");
            dic.Add("5460", "发送日切通知失败*发送日切通知失败");
            dic.Add("5836", "不允许信用卡注册*不允许信用卡注册");
            dic.Add("5837", "卡号和行别不一致*卡号和行别不一致");
            dic.Add("5850", "已经存在相同银行卡号注册的用户*已经存在相同银行卡号注册的用户");
            dic.Add("5851", "已经存在相同证件号注册的用户*已经存在相同证件号注册的用户");
            dic.Add("5852", "实名验证失败*实名验证失败");
            dic.Add("5853", "商户IP不允许访问*商户IP不允许访问");
            dic.Add("5854", "协议库验证日期超过7天*协议库验证日期超过7天");
            dic.Add("5855", "该手机号绑定卡号超过2张*该手机号绑定卡号超过2张(在代收付系统解约)");
            dic.Add("5856", "无权限访问该接口*无权限访问该接口");
            dic.Add("5857", "实名验证失败,当日总验证次数超限*验证次数超限");
            dic.Add("5891", "用户已开户*用户已开户");
            dic.Add("9000", "未知的操作方式，参数错误*系统异常");
            dic.Add("9001", "未知的取流水号方式*系统异常");
            dic.Add("9002", "找不到连接机构*系统异常");
            dic.Add("9003", "连接机构已关闭*机构已关闭");
            dic.Add("9004", "连接机构非法*机构状态异常");
            dic.Add("9005", "未知的查找原交易方式*系统异常");
            dic.Add("9006", "未知的余额检查类型*系统异常");
            dic.Add("9007", "未知的交易日志更新方式*系统异常");
            dic.Add("9008", "未知的授权历史日志更新方式*系统异常");
            dic.Add("9009", "未知的原交易日志更新方式*系统异常");
            dic.Add("9010", "未知的原授权历史日志更新方式*系统异常");
            dic.Add("9011", "未知的原始交易数据用法*系统异常");
            dic.Add("9012", "未知的账户资料更新方式*系统异常");
            dic.Add("9013", "未知的授权历史日志检查方式*系统异常");
            dic.Add("9014", "未知的原交易更新对象*系统异常");
            dic.Add("9015", "未知的账户状态检查方式*系统异常");
            dic.Add("9016", "系统异常*系统异常");
            dic.Add("9701", "内存错误*系统异常");
            dic.Add("9801", "数据库错误*系统异常");
            dic.Add("9802", "提交数据库事务失败*系统异常");
            dic.Add("9803", "数据库SELECT操作失败*系统异常");
            dic.Add("9804", "数据库INSERT操作失败*系统异常");
            dic.Add("9805", "数据库UPDATE操作失败*系统异常");
            dic.Add("9806", "数据库事务回滚失败*系统异常");
            dic.Add("9901", "SOTP同步调用失败*系统异常");
            dic.Add("9902", "SOTP异步调用失败*系统异常");
            dic.Add("210001", "发送kbpsDataBean失败*系统异常");
            dic.Add("210002", "kbps没有初始化，无法连接*系统异常");
            dic.Add("10029", "金额超限*金额超限");
            dic.Add("100011", "卡号或者户名不符*卡号或者户名不符");
            dic.Add("5555", "交易确定超时*交易确定超时");
            dic.Add("5556", "用户信息修改期间不能代扣充值或提现*用户信息修改期间不能代扣充值或提现");
            dic.Add("5557", "用户未授权*用户未授权");
            dic.Add("100017", "余额不足");


        }
        private ErroCode() { }
        static readonly ErroCode _ins = new ErroCode();
        /// <summary>
        /// 富有接口代码描述
        /// </summary>
        public static ErroCode FuyouDescription { get { return _ins; } }

        /// <summary>
        /// 代码描述
        /// </summary>
        /// <param name="code">索引</param>
        /// <returns>代码描述</returns>
        public string this[string code]
        {
            get
            {
                if (dic.ContainsKey(code))
                    return dic[code];
                return "无此错误代码,请咨询富友";
            }
        }
    }

}
